import people_class
import method

print("------------------------------------------------")
print("--------------人际关系系统beta版----------------")
print("------------------------------------------------")


print("请输入你想进行的操作：")
print("1.添加点")
print("2.删除点")
print("3.添加边")
print("4.删除边")
print("5.计算两个点之间的连通性")
print("6.计算两个点之间的距离（有权）")
print("7.计算两个点之间的距离（无权）")
print("8.获得某个节点的属性")
print("9.获得边的属性")
print("10.获得某点的相邻节点")
print("11.获得某点的相邻边")
print("12.判断图是否包含某点")
print("13.判断图是否包含某边")
print("14.获得点的数量")
print("15.获得边的数量")